In [271]:
# it's powerful data manipulation library
# widely used for data analysis and data cleaning
# it provides two primary data structures: Series and DataFrame
# A series is a 1D array like object while Dataframe is a 2D (rows & columns)

In [272]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [273]:
import pandas as pd

In [274]:
## series

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [275]:
## dictionary

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [276]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [277]:
## Dataframe
## create a dataframe from a dict of list

data={
    'Name':['Binal','Bhoomi','Riya'],
    'Age':[25,30,45],
    'city':['Banglore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      city
0   Binal   25  Banglore
1  Bhoomi   30  New York
2    Riya   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [278]:
## create a dataframe from a list of dict

data=[
    {'Name':'Binal','Age':32,'city':'Banglore'}, 
    {'Name':'Bhoomi','Age':33,'city':'New York'},
    {'Name':'Riya','Age':34,'city':'Florida'},
    {'Name':'Drashti','Age':35,'city':'Chikago'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago
<class 'pandas.core.frame.DataFrame'>

In [279]:
import pandas as pd
df = pd.read_csv("sales_data_sample.csv", encoding="latin1", sep=None, engine="python")
print(df.head())

                                                   | Unnamed: 1 Unnamed: 2  \
0  | ORDERNUMBER | QUANTITYORDERED | PRICEEACH | ...       None       None
1                                                  |        NaN        NaN
2  |       10107 |              30 |      95.7 | ...       None       None
3                                                  |        NaN        NaN
4  |       10121 |              34 |     81.35 | ...       None       None

  Unnamed: 3 Unnamed: 4  Unnamed: 5  Unnamed: 6  Unnamed: 7  Unnamed: 8  \
0       None       None         NaN         NaN         NaN         NaN
1        NaN        NaN         NaN         NaN         NaN         NaN
2       None       None         NaN         NaN         NaN         NaN
3        NaN        NaN         NaN         NaN         NaN         NaN
4       None       None         NaN         NaN         NaN         NaN

   Unnamed: 9  ...  Unnamed: 376  Unnamed: 377  Unnamed: 378 Unnamed: 379  \
0         NaN  ...           NaN           NaN           NaN          NaN
1         NaN  ...           NaN           NaN           NaN          NaN
2         NaN  ...           NaN           NaN           NaN          NaN
3         NaN  ...           NaN           NaN           NaN          NaN
4         NaN  ...           NaN           NaN           NaN          NaN

   Unnamed: 380  Unnamed: 381  Unnamed: 382  Unnamed: 383  Unnamed: 384  |.25
0           NaN           NaN           NaN           NaN           NaN  None
1           NaN           NaN           NaN           NaN           NaN     |
2           NaN           NaN           NaN           NaN           NaN  None
3           NaN           NaN           NaN           NaN           NaN     |
4           NaN           NaN           NaN           NaN           NaN  None

[5 rows x 386 columns]

In [280]:
df.tail(5)

,|,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 376,Unnamed: 377,Unnamed: 378,Unnamed: 379,Unnamed: 380,Unnamed: 381,Unnamed: 382,Unnamed: 383,Unnamed: 384,|.25
5643,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
5644,| 10397 | 34 | 62.24 | ...,Lorraine | |...,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
5645,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
5646,| 10414 | 47 | 65.52 | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
5647,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|

In [281]:
## accessing data from dataframe
df=pd.DataFrame(data)

In [282]:
data

[{'Name': 'Binal', 'Age': 32, 'city': 'Banglore'},
 {'Name': 'Bhoomi', 'Age': 33, 'city': 'New York'},
 {'Name': 'Riya', 'Age': 34, 'city': 'Florida'},
 {'Name': 'Drashti', 'Age': 35, 'city': 'Chikago'}]

In [283]:
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [284]:
df['Name']

0      Binal
1     Bhoomi
2       Riya
3    Drashti
Name: Name, dtype: object

In [285]:
df.loc[0]    ## row index

Name       Binal
Age           32
city    Banglore
Name: 0, dtype: object

In [286]:
df.iloc[0][2]    ## specific index

/tmp/ipykernel_25756/2412317762.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]    ## specific index

'Banglore'

In [287]:
df.loc[0][0]

/tmp/ipykernel_25756/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Binal'

In [288]:
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [289]:
## accessing a specified element
print(df.at[2,'Age'])

34

In [290]:
print(df.at[2,'Name'])

Riya

In [291]:
## accessing a specified element using iat
print(df.iat[2,2])

Florida

In [292]:
### data manipulation with dataframe
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [293]:
df['Salary']=[50000,60000,70000,80000]
df

      Name  Age      city  Salary
0    Binal   32  Banglore   50000
1   Bhoomi   33  New York   60000
2     Riya   34   Florida   70000
3  Drashti   35   Chikago   80000

In [294]:
## remove a column
df.drop('Salary',axis=1,inplace=True)  ## drop is temporary operation so use inplace=True for permenent

In [295]:
df

      Name  Age      city
0    Binal   32  Banglore
1   Bhoomi   33  New York
2     Riya   34   Florida
3  Drashti   35   Chikago

In [296]:
## add age to the column
df['Age']=df['Age']+1
df

      Name  Age      city
0    Binal   33  Banglore
1   Bhoomi   34  New York
2     Riya   35   Florida
3  Drashti   36   Chikago

In [297]:
df.drop(0,inplace=True)

In [298]:
df

      Name  Age      city
1   Bhoomi   34  New York
2     Riya   35   Florida
3  Drashti   36   Chikago

In [299]:
import pandas as pd
df = pd.read_csv("sales_data_sample.csv", encoding="latin1", sep=None, engine="python")
df.head(5)

,|,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 376,Unnamed: 377,Unnamed: 378,Unnamed: 379,Unnamed: 380,Unnamed: 381,Unnamed: 382,Unnamed: 383,Unnamed: 384,|.25
0,| ORDERNUMBER | QUANTITYORDERED | PRICEEACH | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
1,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
2,| 10107 | 30 | 95.7 | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
3,|,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,|
4,| 10121 | 34 | 81.35 | ...,None,None,None,None,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None

In [300]:
# Display the data types of each column
print("Data types:\n",df.dtypes)

# Descibes the dataframe
print("stastical sumary:\n",df.describe())

Data types:
 |                object
Unnamed: 1       object
Unnamed: 2       object
Unnamed: 3       object
Unnamed: 4       object
                 ...
Unnamed: 381    float64
Unnamed: 382    float64
Unnamed: 383    float64
Unnamed: 384    float64
|.25             object
Length: 386, dtype: object
stastical sumary:
        Unnamed: 5  Unnamed: 6  Unnamed: 7  Unnamed: 8  Unnamed: 9  \
count         0.0         0.0         0.0         0.0         0.0
mean          NaN         NaN         NaN         NaN         NaN
std           NaN         NaN         NaN         NaN         NaN
min           NaN         NaN         NaN         NaN         NaN
25%           NaN         NaN         NaN         NaN         NaN
50%           NaN         NaN         NaN         NaN         NaN
75%           NaN         NaN         NaN         NaN         NaN
max           NaN         NaN         NaN         NaN         NaN

       Unnamed: 10  Unnamed: 11  Unnamed: 12  Unnamed: 14  Unnamed: 15  ...  \
count          0.0          0.0          0.0          0.0          0.0  ...
mean           NaN          NaN          NaN          NaN          NaN  ...
std            NaN          NaN          NaN          NaN          NaN  ...
min            NaN          NaN          NaN          NaN          NaN  ...
25%            NaN          NaN          NaN          NaN          NaN  ...
50%            NaN          NaN          NaN          NaN          NaN  ...
75%            NaN          NaN          NaN          NaN          NaN  ...
max            NaN          NaN          NaN          NaN          NaN  ...

       Unnamed: 374  Unnamed: 376  Unnamed: 377  Unnamed: 378  Unnamed: 379  \
count           0.0           0.0           0.0           0.0           0.0
mean            NaN           NaN           NaN           NaN           NaN
std             NaN           NaN           NaN           NaN           NaN
min             NaN           NaN           NaN           NaN           NaN
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max             NaN           NaN           NaN           NaN           NaN

       Unnamed: 380  Unnamed: 381  Unnamed: 382  Unnamed: 383  Unnamed: 384
count           0.0           0.0           0.0           0.0           0.0
mean            NaN           NaN           NaN           NaN           NaN
std             NaN           NaN           NaN           NaN           NaN
min             NaN           NaN           NaN           NaN           NaN
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max             NaN           NaN           NaN           NaN           NaN

[8 rows x 356 columns]

In [301]:
df.describe()

,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 14,Unnamed: 15,...,Unnamed: 374,Unnamed: 376,Unnamed: 377,Unnamed: 378,Unnamed: 379,Unnamed: 380,Unnamed: 381,Unnamed: 382,Unnamed: 383,Unnamed: 384
count,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [302]:
import pandas as pd

In [303]:
df=pd.read_csv('sales_data.csv')

In [304]:
df.head(5)

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [305]:
df.tail(5)

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
995,1010,2023-04-15,Charlie,North,4733.88,4,Food,4943.03,5442.15,Returning,0.29,Cash,Online,North-Charlie
996,1067,2023-09-07,Bob,North,4716.36,37,Clothing,1754.32,1856.40,New,0.21,Bank Transfer,Retail,North-Bob
997,1018,2023-04-27,David,South,7629.70,17,Clothing,355.72,438.27,Returning,0.06,Bank Transfer,Online,South-David
998,1100,2023-12-20,David,West,1629.47,39,Electronics,3685.03,3743.39,New,0.01,Bank Transfer,Online,West-David
999,1086,2023-08-16,Alice,East,4923.93,48,Food,2632.58,2926.68,Returning,0.14,Cash,Online,East-Alice

In [306]:
df.describe()

,Product_ID,Sales_Amount,Quantity_Sold,Unit_Cost,Unit_Price,Discount
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,1050.128000,5019.265230,25.355000,2475.304550,2728.440120,0.15239
std,29.573505,2846.790126,14.159006,1417.872546,1419.399839,0.08720
min,1001.000000,100.120000,1.000000,60.280000,167.120000,0.00000
25%,1024.000000,2550.297500,13.000000,1238.380000,1509.085000,0.08000
50%,1051.000000,5019.300000,25.000000,2467.235000,2696.400000,0.15000
75%,1075.000000,7507.445000,38.000000,3702.865000,3957.970000,0.23000
max,1100.000000,9989.040000,49.000000,4995.300000,5442.150000,0.30000

In [307]:
df.dtypes

Product_ID                int64
Sale_Date                object
Sales_Rep                object
Region                   object
Sales_Amount            float64
Quantity_Sold             int64
Product_Category         object
Unit_Cost               float64
Unit_Price              float64
Customer_Type            object
Discount                float64
Payment_Method           object
Sales_Channel            object
Region_and_Sales_Rep     object
dtype: object

In [308]:
## handling missing value
df.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [309]:
df.isnull().sum()

Product_ID              0
Sale_Date               0
Sales_Rep               0
Region                  0
Sales_Amount            0
Quantity_Sold           0
Product_Category        0
Unit_Cost               0
Unit_Price              0
Customer_Type           0
Discount                0
Payment_Method          0
Sales_Channel           0
Region_and_Sales_Rep    0
dtype: int64

In [310]:
df_filled=df.fillna(0)

In [311]:
## filling missing values with the mean of the column

## none of the value is null in above data

In [312]:
df.dtypes

Product_ID                int64
Sale_Date                object
Sales_Rep                object
Region                   object
Sales_Amount            float64
Quantity_Sold             int64
Product_Category         object
Unit_Cost               float64
Unit_Price              float64
Customer_Type            object
Discount                float64
Payment_Method           object
Sales_Channel            object
Region_and_Sales_Rep     object
dtype: object

In [313]:
## renaming columns
df=df.rename(columns={'Sale_Date':'Sales Date'})
df=df.rename(columns={'Quantity_Sold':'New_Value'})
df.head()

,Product_ID,Sales Date,Sales_Rep,Region,Sales_Amount,New_Value,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [314]:
df['Value_New']=df['New_Value'].apply(lambda x:x*2)
df

,Product_ID,Sales Date,Sales_Rep,Region,Sales_Amount,New_Value,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep,Value_New
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob,36
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob,34
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David,60
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob,78
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1010,2023-04-15,Charlie,North,4733.88,4,Food,4943.03,5442.15,Returning,0.29,Cash,Online,North-Charlie,8
996,1067,2023-09-07,Bob,North,4716.36,37,Clothing,1754.32,1856.40,New,0.21,Bank Transfer,Retail,North-Bob,74
997,1018,2023-04-27,David,South,7629.70,17,Clothing,355.72,438.27,Returning,0.06,Bank Transfer,Online,South-David,34
998,1100,2023-12-20,David,West,1629.47,39,Electronics,3685.03,3743.39,New,0.01,Bank Transfer,Online,West-David,78
999,1086,2023-08-16,Alice,East,4923.93,48,Food,2632.58,2926.68,Returning,0.14,Cash,Online,East-Alice,96

In [315]:
## data aggregating and grouping
df.head(5)

,Product_ID,Sales Date,Sales_Rep,Region,Sales_Amount,New_Value,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep,Value_New
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob,36
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob,34
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David,60
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob,78
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie,26

In [316]:
grouped_mean=df.groupby('Product_Category')['New_Value'].mean()
print(grouped_mean)

Product_Category
Clothing       25.828358
Electronics    24.780488
Food           24.814159
Furniture      25.880769
Name: New_Value, dtype: float64

In [317]:
grouped_sum=df.groupby(['Product_Category','Region'])['New_Value'].sum()
grouped_sum

Product_Category  Region
Clothing          East      1797
                  North     1939
                  South     1517
                  West      1669
Electronics       East      1623
                  North     1660
                  South     1274
                  West      1539
Food              East      1463
                  North     1179
                  South     1577
                  West      1389
Furniture         East      1473
                  North     1927
                  South     1440
                  West      1889
Name: New_Value, dtype: int64

In [318]:
df.groupby(['Product_Category','Region'])['New_Value'].mean()

Product_Category  Region
Clothing          East      23.644737
                  North     25.513158
                  South     27.581818
                  West      27.360656
Electronics       East      24.969231
                  North     25.538462
                  South     22.350877
                  West      26.084746
Food              East      23.222222
                  North     24.562500
                  South     27.189655
                  West      24.368421
Furniture         East      24.966102
                  North     24.705128
                  South     25.714286
                  West      28.194030
Name: New_Value, dtype: float64

In [319]:
## aggregate multiple function
grouped_agg=df.groupby('Region')['New_Value'].agg(['mean','sum','count'])
grouped_agg

             mean   sum  count
Region
East    24.167300  6356    263
North   25.112360  6705    267
South   25.699115  5808    226
West    26.581967  6486    244

In [320]:
## merging and joining dataframe
# create sample dataframe
df1=pd.DataFrame({'key':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'key':['A','B','D'],'Value2':[4,5,6]})

In [321]:
df1

  key  Value1
0   A       1
1   B       2
2   C       3

In [322]:
df2

  key  Value2
0   A       4
1   B       5
2   D       6

In [324]:
## merge dataframe on the 'key column'
pd.merge(df1,df2,on="key",how="inner")

  key  Value1  Value2
0   A       1       4
1   B       2       5

In [325]:
pd.merge(df1,df2,on="key",how="outer")

  key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [326]:
pd.merge(df1,df2,on="key",how="left")

  key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [327]:
pd.merge(df1,df2,on="key",how="right")

  key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

In [1]:
# READING DATA FROM DIFFERENT SOURCES

In [9]:
import pandas as pd
from io import StringIO
Data='{"employee_name":"James", "email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [10]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [12]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [13]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [14]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [30]:
!pip install lxml

Requirement already satisfied: lxml in /usr/local/python/3.12.1/lib/python3.12/site-packages (6.0.2)

In [31]:
url="https://www.fdic.gov/bank-failures/failed-bank-list"
df=pd.read_html(url)

In [32]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [35]:
!pip install html5

Requirement already satisfied: html5 in /usr/local/python/3.12.1/lib/python3.12/site-packages (0.0.9)
Requirement already satisfied: setuptools>=18.5 in /home/codespace/.local/lib/python3.12/site-packages (from html5) (80.9.0)
Requirement already satisfied: six in /home/codespace/.local/lib/python3.12/site-packages (from html5) (1.17.0)
Requirement already satisfied: webencodings in /home/codespace/.local/lib/python3.12/site-packages (from html5) (0.5.1)

In [41]:
import pandas as pd
import requests

url = "https://en.wikipedia.org/wiki/Mobile_country_code"

headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64)"
}

response = requests.get(url, headers=headers)
response.raise_for_status()

tables = pd.read_html(response.text, match="Country", header=0)
df = tables[0]

print(df.head())

   Mobile country code                                    Country ISO 3166  \
0                  289                                 A Abkhazia    GE-AB
1                  412                                Afghanistan       AF
2                  276                                    Albania       AL
3                  603                                    Algeria       DZ
4                  544  American Samoa (United States of America)       AS

                             Mobile network codes National MNC authority  \
0        List of mobile network codes in Abkhazia                    NaN
1     List of mobile network codes in Afghanistan                    NaN
2         List of mobile network codes in Albania                    NaN
3         List of mobile network codes in Algeria                    NaN
4  List of mobile network codes in American Samoa                    NaN

                    Remarks
0  MCC is not listed by ITU
1                       NaN
2                       NaN
3                       NaN
4                       NaN

/tmp/ipykernel_1747/1829778523.py:13: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(response.text, match="Country", header=0)